; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_2 ?v7 - type_3 ?v3 - type_2)
 	      (pred_3 ?v6 - object ?v3 - type_2)
	      (pred_1 ?v7 - type_3 ?v2 - type_1)
	      (pred_4 ?v7 - type_3 ?v6 - object ?v2 - type_1))

   (:action op_1
       :parameters  (?v7 - type_3 ?v1 ?v8 - type_2)
       :precondition (and  (pred_2 ?v7 ?v1))
       :effect (and  (pred_2 ?v7 ?v8)
		     (not (pred_2 ?v7 ?v1))))

   (:action op_2
       :parameters (?v7 - type_3 ?v4 - object ?v5 - type_2 ?v2 - type_1)
       :precondition  (and  (pred_3 ?v4 ?v5) (pred_2 ?v7 ?v5) (pred_1 ?v7 ?v2))
       :effect (and (pred_4 ?v7 ?v4 ?v2)
		    (not (pred_3 ?v4 ?v5)) 
		    (not (pred_1 ?v7 ?v2))))

   (:action op_3
       :parameters (?v7 - type_3 ?v4 - object ?v5 - type_2 ?v2 - type_1)
       :precondition  (and  (pred_4 ?v7 ?v4 ?v2) (pred_2 ?v7 ?v5))
       :effect (and (pred_3 ?v4 ?v5)
		    (pred_1 ?v7 ?v2)
		    (not (pred_4 ?v7 ?v4 ?v2)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_03 obj_05 - type_3
obj_11 obj_06 obj_04 obj_08 - type_1
obj_07 obj_12 obj_01 - type_2
obj_09 obj_10 obj_02 - object)
(:init
(pred_2 obj_03 obj_01)
(pred_1 obj_03 obj_11)
(pred_1 obj_03 obj_06)
(pred_2 obj_05 obj_12)
(pred_1 obj_05 obj_04)
(pred_1 obj_05 obj_08)
(pred_3 obj_09 obj_01)
(pred_3 obj_10 obj_01)
(pred_3 obj_02 obj_01)
)
(:goal
(and
(pred_3 obj_09 obj_12)
(pred_3 obj_10 obj_12)
(pred_3 obj_02 obj_07)
)
)

(:constraints
  (and
    (always (not (and (pred_2 obj_03 obj_01) (pred_2 obj_05 obj_01))))
  )
)
)

; plan
1. (op_2 obj_03 obj_02 obj_01 obj_06)
   deleted: (pred_3 obj_02 obj_01) (pred_1 obj_03 obj_06)
   added: (pred_4 obj_03 obj_02 obj_06)
   goals met: 0 of 3
2. (op_1 obj_03 obj_01 obj_07)
   deleted: (pred_2 obj_03 obj_01)
   added: (pred_2 obj_03 obj_07)
   goals met: 0 of 3
3. (op_1 obj_05 obj_12 obj_01)
   deleted: (pred_2 obj_05 obj_12)
   added: (pred_2 obj_05 obj_01)
   goals met: 0 of 3
4. (op_3 obj_03 obj_02 obj_07 obj_06)
   deleted: (pred_4 obj_03 obj_02 obj_06)
   added: (pred_3 obj_02 obj_07) (pred_1 obj_03 obj_06)
   goals met: 1 of 3
5. (op_2 obj_05 obj_10 obj_01 obj_08)
   deleted: (pred_3 obj_10 obj_01) (pred_1 obj_05 obj_08)
   added: (pred_4 obj_05 obj_10 obj_08)
   goals met: 1 of 3
6. (op_2 obj_05 obj_09 obj_01 obj_04)
   deleted: (pred_3 obj_09 obj_01) (pred_1 obj_05 obj_04)
   added: (pred_4 obj_05 obj_09 obj_04)
   goals met: 1 of 3
7. (op_1 obj_05 obj_01 obj_12)
   deleted: (pred_2 obj_05 obj_01)
   added: (pred_2 obj_05 obj_12)
   goals met: 1 of 3
8. (op_3 obj_05 obj_10 obj_12 obj_08)
   deleted: (pred_4 obj_05 obj_10 obj_08)
   added: (pred_3 obj_10 obj_12) (pred_1 obj_05 obj_08)
   goals met: 2 of 3
9. (op_3 obj_05 obj_09 obj_12 obj_04)
   deleted: (pred_4 obj_05 obj_09 obj_04)
   added: (pred_3 obj_09 obj_12) (pred_1 obj_05 obj_04)
   goals met: 3 of 3
